In [1]:
%run crawlers.py

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
numbers3 = pd.read_csv('lotto3.csv', dtype=object)
numbers4 = pd.read_csv('lotto4.csv', dtype=object)

In [5]:
numbers3.head()

  index  num num1 num2 num3
0     1  191    1    9    1
1     2  988    9    8    8
2     3  194    1    9    4
3     4  105    1    0    5
4     5  592    5    9    2

In [6]:
numbers4.head()

  index   num num1 num2 num3 num4
0     1  1149    1    1    4    9
1     2  7921    7    9    2    1
2     3  0097    0    0    9    7
3     4  0171    0    1    7    1
4     5  0265    0    2    6    5

In [8]:
numbers4_1 = numbers4.num1.value_counts()
numbers4_2 = numbers4.num2.value_counts()
numbers4_3 = numbers4.num3.value_counts()
numbers4_4 = numbers4.num4.value_counts()

numbers3_1 = numbers3.num1.value_counts()
numbers3_2 = numbers3.num2.value_counts()
numbers3_3 = numbers3.num3.value_counts()

In [9]:
numbers4_1

6    585
7    564
8    557
9    554
4    554
0    550
3    547
2    544
5    526
1    502
Name: num1, dtype: int64

In [10]:
numbers4_2

9    595
5    581
3    575
7    565
8    556
0    555
1    548
4    529
6    526
2    453
Name: num2, dtype: int64

In [11]:
numbers4_3

0    582
9    581
7    560
8    556
3    555
5    550
4    540
1    538
6    513
2    508
Name: num3, dtype: int64

In [12]:
numbers4_4

9    598
1    595
5    550
2    547
0    547
6    541
4    537
7    528
8    522
3    518
Name: num4, dtype: int64

In [13]:
numbers3_1

9    578
8    573
6    568
3    560
2    557
1    551
4    541
7    532
0    526
5    497
Name: num1, dtype: int64

In [14]:
numbers3_2

0    580
3    573
9    564
7    552
1    547
2    542
4    540
6    532
5    529
8    524
Name: num2, dtype: int64

In [15]:
numbers3_3

2    573
8    573
9    567
7    562
1    549
3    538
4    537
5    534
0    526
6    524
Name: num3, dtype: int64

In [36]:
counter4_all = pd.concat([numbers4_1, numbers4_2, numbers4_3, numbers4_4], axis=1)

In [37]:
counter3_all = pd.concat([numbers3_1, numbers3_2, numbers3_3], axis=1)

In [41]:
counter3_all = counter3_all.sort_index()

In [42]:
counter4_all = counter4_all.sort_index()

In [43]:
counter3_all

   num1  num2  num3
0   526   580   526
1   551   547   549
2   557   542   573
3   560   573   538
4   541   540   537
5   497   529   534
6   568   532   524
7   532   552   562
8   573   524   573
9   578   564   567

In [44]:
counter4_all

   num1  num2  num3  num4
0   550   555   582   547
1   502   548   538   595
2   544   453   508   547
3   547   575   555   518
4   554   529   540   537
5   526   581   550   550
6   585   526   513   541
7   564   565   560   528
8   557   556   556   522
9   554   595   581   598